In [1]:
#Create a dataframe with 4 columns 4 rows
import pandas as t
x=[[1,2,3,4],[2,3,1,7],[6,5,7,3],[3,8,6,7]]
u=t.DataFrame(x,index=["x1","x2","x3","x4"],columns=["c1","c2","c3","c4"])
u

    c1  c2  c3  c4
x1   1   2   3   4
x2   2   3   1   7
x3   6   5   7   3
x4   3   8   6   7

In [2]:
#print all Columns form your data frame
u.columns

Index(['c1', 'c2', 'c3', 'c4'], dtype='object')

In [3]:
#print all rows from your data frame
u.loc[:]

    c1  c2  c3  c4
x1   1   2   3   4
x2   2   3   1   7
x3   6   5   7   3
x4   3   8   6   7

In [4]:
#print Second  column in your data frame
u["c2"]

x1    2
x2    3
x3    5
x4    8
Name: c2, dtype: int64

In [5]:
#print last 2 columns from your data Frame
u.loc[:,"c3":]

    c3  c4
x1   3   4
x2   1   7
x3   7   3
x4   6   7

In [6]:
#print  fourth row from your data Frame
u.loc["x4":,"c1":]

    c1  c2  c3  c4
x4   3   8   6   7

In [7]:
#print first 2  Rows from your data Frame
u.loc[:"x2",:]

    c1  c2  c3  c4
x1   1   2   3   4
x2   2   3   1   7

In [8]:
#print all rows and first 2 columns from your data Frame
u.loc["x1":,:"c2"]

    c1  c2
x1   1   2
x2   2   3
x3   6   5
x4   3   8

In [9]:
#Delete any row from your data Frame
u.drop("x4")

    c1  c2  c3  c4
x1   1   2   3   4
x2   2   3   1   7
x3   6   5   7   3

In [10]:
#Delete any column from your data Frame
u.pop("c3")

x1    3
x2    1
x3    7
x4    6
Name: c3, dtype: int64

In [11]:
#Add a column to a Data Frame
col=['2','3','5','7']
u["c3"]=col
u

    c1  c2  c4 c3
x1   1   2   4  2
x2   2   3   7  3
x3   6   5   3  5
x4   3   8   7  7

In [12]:
#Add a Row to Data Frame
row={"c1":3,"c2":6,"c3":8}

In [13]:
#Iterate all Columns  in your Data Frame and print result
for i in u:
    print(i)

c1
c2
c4
c3

In [14]:
#Iterate the 3rd column values  of your Data frame and print result.

In [15]:
#Iterate all Rows  in your Data Frame and print result.
for i in u.iterrows():
    print(i)

('x1', c1    1
c2    2
c4    4
c3    2
Name: x1, dtype: object)
('x2', c1    2
c2    3
c4    7
c3    3
Name: x2, dtype: object)
('x3', c1    6
c2    5
c4    3
c3    5
Name: x3, dtype: object)
('x4', c1    3
c2    8
c4    7
c3    7
Name: x4, dtype: object)

In [16]:
#Read income.csv  file and print as Data Frame
file="income.csv"
k=t.read_csv(file)
print(t.DataFrame(k))

       GEOID       State   2005   2006   2007   2008   2009   2010   2011  \
0  04000US01     Alabama  37150  37952  42212  44476  39980  40933  42590
1  04000US02      Alaska  55891  56418  62993  63989  61604  57848  57431
2  04000US04     Arizona  45245  46657  62993  46914  45739  46896  48621
3  04000US05    Arkansas  36658  37057  40795  39586  36538  38587  41302
4  04000US06  California  51755  55319  55734  57014  56134  54283  53367

    2012   2013
0  43464  41381
1  63648  61137
2  47044  50602
3  39018  39919
4  57020  57528

In [21]:
#Get 2006 column  info from your data Frame by using drop
help(u.drop)

Help on method drop in module pandas.core.frame:

drop(labels=None, axis=0, index=None, columns=None, level=None, inplace=False, errors='raise') method of pandas.core.frame.DataFrame instance
    Drop specified labels from rows or columns.

    Remove rows or columns by specifying label names and corresponding
    axis, or by specifying directly index or column names. When using a
    multi-index, labels on different levels can be removed by specifying
    the level.

    Parameters
    ----------
    labels : single label or list-like
        Index or column labels to drop.
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Whether to drop labels from the index (0 or 'index') or
        columns (1 or 'columns').
    index, columns : single label or list-like
        Alternative to specifying axis (``labels, axis=1``
        is equivalent to ``columns=labels``).

        .. versionadded:: 0.21.0
    level : int or level name, optional
        For MultiIndex, level from which the labels will be removed.
    inplace : bool, default False
        If True, do operation inplace and return None.
    errors : {'ignore', 'raise'}, default 'raise'
        If 'ignore', suppress error and only existing labels are
        dropped.

    Returns
    -------
    dropped : pandas.DataFrame

    Raises
    ------
    KeyError
        If none of the labels are found in the selected axis

    See Also
    --------
    DataFrame.loc : Label-location based indexer for selection by label.
    DataFrame.dropna : Return DataFrame with labels on given axis omitted
        where (all or any) data are missing.
    DataFrame.drop_duplicates : Return DataFrame with duplicate rows
        removed, optionally only considering certain columns.
    Series.drop : Return Series with specified index labels removed.

    Examples
    --------
    >>> df = pd.DataFrame(np.arange(12).reshape(3,4),
    ...                   columns=['A', 'B', 'C', 'D'])
    >>> df
       A  B   C   D
    0  0  1   2   3
    1  4  5   6   7
    2  8  9  10  11

    Drop columns

    >>> df.drop(['B', 'C'], axis=1)
       A   D
    0  0   3
    1  4   7
    2  8  11

    >>> df.drop(columns=['B', 'C'])
       A   D
    0  0   3
    1  4   7
    2  8  11

    Drop a row by index

    >>> df.drop([0, 1])
       A  B   C   D
    2  8  9  10  11

    Drop columns and/or rows of MultiIndex DataFrame

    >>> midx = pd.MultiIndex(levels=[['lama', 'cow', 'falcon'],
    ...                              ['speed', 'weight', 'length']],
    ...                      codes=[[0, 0, 0, 1, 1, 1, 2, 2, 2],
    ...                             [0, 1, 2, 0, 1, 2, 0, 1, 2]])
    >>> df = pd.DataFrame(index=midx, columns=['big', 'small'],
    ...                   data=[[45, 30], [200, 100], [1.5, 1], [30, 20],
    ...                         [250, 150], [1.5, 0.8], [320, 250],
    ...                         [1, 0.8], [0.3,0.2]])
    >>> df
                    big     small
    lama    speed   45.0    30.0
            weight  200.0   100.0
            length  1.5     1.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
            length  1.5     0.8
    falcon  speed   320.0   250.0
            weight  1.0     0.8
            length  0.3     0.2

    >>> df.drop(index='cow', columns='small')
                    big
    lama    speed   45.0
            weight  200.0
            length  1.5
    falcon  speed   320.0
            weight  1.0
            length  0.3

    >>> df.drop(index='length', level=1)
                    big     small
    lama    speed   45.0    30.0
            weight  200.0   100.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
    falcon  speed   320.0   250.0
            weight  1.0     0.8

In [23]:
k.drop(columns=["2006"],axis=1)

,GEOID,State,2005,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55734,57014,56134,54283,53367,57020,57528